export const errors = {
    EMPTY_FIELDS: "Все поля должны быть заполнены",
    NOT_CYRILLIC_SYMBOLS:
        "ФИО должно состоять только из кириллицы, Должность не должна включать в себя спец.символы",
    NOT_UNIQUE_LOGIN: "Пользователь с таким логином уже существует",
    INCORRECT_LOGIN: "Некорректный логин нового пользователя",
    NO_SELECTED: "Выберите роль",
    EMPTY_NAME: "Имя не может быть пустым",
    ROLE_ALREADY_EXISTS: "Роль с таким именем уже существует",
    INVALID_ROLE_NAME:
        "В имени могут быть использованы только буквы латиницы и кириллицы, цифры, пробел и дефис",
    // eslint-disable-next-line
    INCORRECT_PASSWORD: "Некорректный пароль нового пользователя",
};
